In [1]:
import pandas as pd
import warnings
warnings.filterwarnings("ignore")

### 1. Athletes' data exploration

In [2]:
athletes = pd.read_excel("datasets/Athletes.xlsx")
athletes.head()

                Name     NOC           Discipline
0    AALERUD Katrine  Norway         Cycling Road
1        ABAD Nestor   Spain  Artistic Gymnastics
2  ABAGNALE Giovanni   Italy               Rowing
3     ABALDE Alberto   Spain           Basketball
4      ABALDE Tamara   Spain           Basketball

##### 1.1 Get athletes data infos: columns types, number of nan, duplicated rows

In [3]:
athletes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11085 entries, 0 to 11084
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        11085 non-null  object
 1   NOC         11085 non-null  object
 2   Discipline  11085 non-null  object
dtypes: object(3)
memory usage: 259.9+ KB

In [4]:
athletes.isnull().sum()

Name          0
NOC           0
Discipline    0
dtype: int64

In [5]:
athletes.duplicated().sum()

1

In [6]:
athletes[ athletes.duplicated() ==True]

            Name      NOC Discipline
254  ALI Mohamed  Bahrain   Handball

In [7]:
athletes[ athletes.Name=="ALI Mohamed"]

            Name      NOC Discipline
253  ALI Mohamed  Bahrain   Handball
254  ALI Mohamed  Bahrain   Handball

##### 1.2 Duplicated rows drop

In [8]:
athletes.drop_duplicates(inplace=True)
athletes[ athletes.Name=="ALI Mohamed"]

            Name      NOC Discipline
253  ALI Mohamed  Bahrain   Handball

In [9]:
athletes.describe()

                 Name                       NOC Discipline
count           11084                     11084      11084
unique          11062                       206         46
top     GANNA Filippo  United States of America  Athletics
freq                2                       615       2068

In [10]:
print(f"Nbres athletes: {len(set(athletes.Name))}")

Nbres athletes: 11062

In [11]:
print(f"Nbres pays: {len(set(athletes.NOC))}")

Nbres pays: 206

In [12]:
print(f"Nbres discipline: {len(set(athletes.Discipline))}")

Nbres discipline: 46

In [13]:
print(f"Liste des Disciplines:\n{set(athletes.Discipline)}")

Liste des Disciplines:
{'Handball', 'Baseball/Softball', 'Cycling Mountain Bike', 'Modern Pentathlon', 'Taekwondo', 'Rowing', 'Rugby Sevens', 'Basketball', 'Beach Volleyball', 'Rhythmic Gymnastics', 'Diving', '3x3 Basketball', 'Swimming', 'Trampoline Gymnastics', 'Cycling Road', 'Karate', 'Football', 'Table Tennis', 'Volleyball', 'Boxing', 'Cycling Track', 'Shooting', 'Water Polo', 'Skateboarding', 'Fencing', 'Canoe Slalom', 'Archery', 'Canoe Sprint', 'Judo', 'Wrestling', 'Triathlon', 'Athletics', 'Artistic Gymnastics', 'Equestrian', 'Sport Climbing', 'Golf', 'Cycling BMX Racing', 'Surfing', 'Cycling BMX Freestyle', 'Marathon Swimming', 'Artistic Swimming', 'Badminton', 'Sailing', 'Hockey', 'Tennis', 'Weightlifting'}

In [14]:
x = list(set(athletes.Discipline))

In [15]:
x[:10]

['Handball',
 'Baseball/Softball',
 'Cycling Mountain Bike',
 'Modern Pentathlon',
 'Taekwondo',
 'Rowing',
 'Rugby Sevens',
 'Basketball',
 'Beach Volleyball',
 'Rhythmic Gymnastics']

In [16]:
x[10:20]

['Diving',
 '3x3 Basketball',
 'Swimming',
 'Trampoline Gymnastics',
 'Cycling Road',
 'Karate',
 'Football',
 'Table Tennis',
 'Volleyball',
 'Boxing']

### 2. Coaches data exploration

In [17]:
coaches = pd.read_excel('datasets/Coaches.xlsx')
coaches.head()

              Name            NOC  Discipline Event
0  ABDELMAGID Wael          Egypt    Football   NaN
1        ABE Junya          Japan  Volleyball   NaN
2    ABE Katsuhiko          Japan  Basketball   NaN
3     ADAMA Cherif  Côte d'Ivoire    Football   NaN
4       AGEBA Yuya          Japan  Volleyball   NaN

##### 2.1 Get coaches data infos

In [18]:
coaches.shape

(394, 4)

In [19]:
coaches.describe()

                         Name    NOC  Discipline Event
count                     394    394         394   249
unique                    381     61           9     6
top     REQUENA PERICAS Judit  Japan  Basketball   Men
freq                        2     35          74    94

In [20]:
coaches.isnull().sum()

Name            0
NOC             0
Discipline      0
Event         145
dtype: int64

In [21]:
coaches.duplicated().sum()

1

In [22]:
coaches[ coaches.duplicated() == True]

                 Name     NOC         Discipline     Event
144  GUERRERO Rolando  Mexico  Baseball/Softball  Softball

In [23]:
coaches[ coaches.Name == "GUERRERO Rolando"]

                 Name     NOC         Discipline     Event
143  GUERRERO Rolando  Mexico  Baseball/Softball  Softball
144  GUERRERO Rolando  Mexico  Baseball/Softball  Softball

##### 2.2 Drop of duplicated rows

In [24]:
coaches.drop_duplicates(inplace=True)

In [25]:
coaches[ coaches.Name == "GUERRERO Rolando"]

                 Name     NOC         Discipline     Event
143  GUERRERO Rolando  Mexico  Baseball/Softball  Softball

In [26]:
print(f"Nbre Coaches:{len(set(coaches.Name))}")

Nbre Coaches:381

In [27]:
print(f"Nbre Discipline coachées:{len(set(coaches.Discipline))}")

Nbre Discipline coachées:9

In [28]:
print("Les disciplines", set(coaches.Discipline))

Les disciplines {'Baseball/Softball', 'Handball', 'Water Polo', 'Football', 'Artistic Swimming', 'Volleyball', 'Hockey', 'Rugby Sevens', 'Basketball'}

In [29]:
set(coaches.Event)

{'Baseball', 'Duet', 'Men', 'Softball', 'Team', 'Women', nan}

### 3. EntriesGender' data exploration

In [30]:
gender = pd.read_excel('datasets/EntriesGender.xlsx')
gender.head()

            Discipline  Female  Male  Total
0       3x3 Basketball      32    32     64
1              Archery      64    64    128
2  Artistic Gymnastics      98    98    196
3    Artistic Swimming     105     0    105
4            Athletics     969  1072   2041

##### 3.1 Get genders data infos

In [31]:
gender.shape

(46, 4)

In [32]:
gender.isnull().sum()

Discipline    0
Female        0
Male          0
Total         0
dtype: int64

In [33]:
gender.duplicated().sum()

0

In [34]:
gender[['Female','Male']].sum()

Female    5432
Male      5884
dtype: int64

In [35]:
gender.isnull().sum()

Discipline    0
Female        0
Male          0
Total         0
dtype: int64

In [36]:
gender.duplicated().sum()

0

### 4. Medals' data exploration

In [37]:
medals = pd.read_excel('datasets/Medals.xlsx')
medals.head()

,Rank,Team/NOC,Gold,Silver,Bronze,Total,Rank by Total
0,1,United States of America,39,41,33,113,1
1,2,People's Republic of China,38,32,18,88,2
2,3,Japan,27,14,17,58,5
3,4,Great Britain,22,21,22,65,4
4,5,ROC,20,28,23,71,3

##### 4.1 Get medals data infos

In [38]:
medals.shape

(93, 7)

In [39]:
medals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 93 entries, 0 to 92
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Rank           93 non-null     int64
 1   Team/NOC       93 non-null     object
 2   Gold           93 non-null     int64
 3   Silver         93 non-null     int64
 4   Bronze         93 non-null     int64
 5   Total          93 non-null     int64
 6   Rank by Total  93 non-null     int64
dtypes: int64(6), object(1)
memory usage: 5.2+ KB

In [40]:
medals = medals.sort_values(by="Rank by Total")
medals.head()

,Rank,Team/NOC,Gold,Silver,Bronze,Total,Rank by Total
0,1,United States of America,39,41,33,113,1
1,2,People's Republic of China,38,32,18,88,2
4,5,ROC,20,28,23,71,3
3,4,Great Britain,22,21,22,65,4
2,3,Japan,27,14,17,58,5

In [41]:
medals.isnull().sum()

Rank             0
Team/NOC         0
Gold             0
Silver           0
Bronze           0
Total            0
Rank by Total    0
dtype: int64

In [42]:
medals.duplicated().sum()

0

### 5. Teams data exploration

In [43]:
teams = pd.read_excel('datasets/Teams.xlsx')
teams.head()

      Name      Discipline                         NOC  Event
0  Belgium  3x3 Basketball                     Belgium    Men
1    China  3x3 Basketball  People's Republic of China    Men
2    China  3x3 Basketball  People's Republic of China  Women
3   France  3x3 Basketball                      France  Women
4    Italy  3x3 Basketball                       Italy  Women

##### 5.1 Get teams data infos

In [44]:
teams.shape

(743, 4)

In [45]:
teams.isnull().sum()

Name          0
Discipline    0
NOC           0
Event         0
dtype: int64

In [46]:
teams.duplicated().sum()

0

In [47]:
teams.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 743 entries, 0 to 742
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        743 non-null    object
 1   Discipline  743 non-null    object
 2   NOC         743 non-null    object
 3   Event       743 non-null    object
dtypes: object(4)
memory usage: 23.3+ KB

In [48]:
len(set(teams.Name))

146

In [49]:
len(set(teams.Discipline))

20

In [50]:
set(teams.Discipline)

{'3x3 Basketball',
 'Archery',
 'Artistic Gymnastics',
 'Artistic Swimming',
 'Athletics',
 'Baseball/Softball',
 'Basketball',
 'Beach Volleyball',
 'Cycling Track',
 'Fencing',
 'Football',
 'Handball',
 'Hockey',
 'Rhythmic Gymnastics',
 'Rugby Sevens',
 'Swimming',
 'Table Tennis',
 'Triathlon',
 'Volleyball',
 'Water Polo'}

In [51]:
athletes.columns

Index(['Name', 'NOC', 'Discipline'], dtype='object')

In [52]:
coaches.columns

Index(['Name', 'NOC', 'Discipline', 'Event'], dtype='object')

In [53]:
gender.columns

Index(['Discipline', 'Female', 'Male', 'Total'], dtype='object')

In [54]:
medals.columns

Index(['Rank', 'Team/NOC', 'Gold', 'Silver', 'Bronze', 'Total',
       'Rank by Total'],
      dtype='object')

In [55]:
set(teams.Discipline)

{'3x3 Basketball',
 'Archery',
 'Artistic Gymnastics',
 'Artistic Swimming',
 'Athletics',
 'Baseball/Softball',
 'Basketball',
 'Beach Volleyball',
 'Cycling Track',
 'Fencing',
 'Football',
 'Handball',
 'Hockey',
 'Rhythmic Gymnastics',
 'Rugby Sevens',
 'Swimming',
 'Table Tennis',
 'Triathlon',
 'Volleyball',
 'Water Polo'}